experiment_results/ftl_hotcold/v1/20260819_025314_KST/runs/T4096/precondition_fio.txt
2026-08-18T18:46:11+00:00
fill: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=32
fio-3.16
Starting 1 process

fill: (groupid=0, jobs=1): err= 0: pid=1128: Tue Aug 18 18:46:26 2026
  write: IOPS=635, BW=636MiB/s (666MB/s)(6144MiB/9667msec); 0 zone resets
    slat (usec): min=36, max=58463, avg=168.26, stdev=1503.33
    clat (msec): min=4, max=395, avg=50.02, stdev=39.38
     lat (msec): min=4, max=395, avg=50.20, stdev=39.47
    clat percentiles (msec):
     |  1.00th=[   26],  5.00th=[   28], 10.00th=[   30], 20.00th=[   32],
     | 30.00th=[   33], 40.00th=[   37], 50.00th=[   44], 60.00th=[   47],
     | 70.00th=[   52], 80.00th=[   57], 90.00th=[   68], 95.00th=[   92],
     | 99.00th=[  326], 99.50th=[  338], 99.90th=[  359], 99.95th=[  393],
     | 99.99th=[  397]
   bw (  KiB/s): min=141102, max=886784, per=99.17%, avg=645446.00, stdev=222446.25, samples=19
   iops        : min=  137, max=  866, avg=630.21, stdev=217.35, samples=19
  lat (msec)   : 10=0.11%, 20=0.26%, 50=67.43%, 100=28.01%, 250=2.69%
  lat (msec)   : 500=1.50%
  cpu          : usr=9.30%, sys=9.26%, ctx=5528, majf=0, minf=11
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.3%, 32=99.5%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,6144,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=636MiB/s (666MB/s), 636MiB/s-636MiB/s (666MB/s-666MB/s), io=6144MiB (6442MB), run=9667-9667msec

Disk stats (read/write):
  nvme0n1: ios=51/6284, merge=0/0, ticks=20/301019, in_queue=288100, util=88.39%
2026-08-18T18:46:26+00:00
fill_rc=0